** Assignment, Binding, Values & Variables

In Scopes there is an explicit distinction between variables and
values. *Variables* are names bound to a place or slot of explicit
memory that can then be mutated later, whereas *values* are immutable
once created and cannot be modified in place.

Because Scopes is a semi-functional Scheme-like language values are
more common than variables, so we describe them first in terms of the
~let~ syntax:

#+begin_src scopes :tangle _bin/assignment_let.sc
  let name = "Bob"
#+end_src

Simple enough. As we will see once we learn about expressions though
that the right hand side can be much more complex than in most
languages.

To assign the result of an expression you just need to syntactically
scope it:

#+begin_src scopes
  let sum = (1 + 2 + 3)
#+end_src

There is an infix version of the let-assignment as well:

#+begin_src scopes
  sum := 1 + 2 + 3
#+end_src

For one we can do multiple assignments in the same let block:

#+begin_src scopes :tangle _bin/assignment_let.sc
  let
      name = "Bob"
      password = "password"
      height = 6
#+end_src

#+RESULTS:

You can also do a multiple assignment like so:

#+begin_src scopes :tangle _bin/assignment_let.sc
  let a b c = 1 2 3
  print "a:" a "b:" b "c:" c
#+end_src

#+RESULTS:
: a: 1 b: 2 c: 3

Note that if you reassign a value to the same name this is not
actually mutating the first value.

#+begin_src scopes :tangle _bin/assignment_let.sc
  let count = 0
  let count = (count + 1)
#+end_src

The storage location (stack, heap, and data segment) of the value
generated from an expression is determined by the kind of expression.

You can explicitly choose stack or data-segment by using the ~local~
or ~global~ mechanisms. 

For those unaware the "stack" is a data structure used in most
programming languages that provides a fast and convenient way to store
data in nested scopes that can easily be managed and torn down without
manual memory managemeng. For example when a function goes out of
scope all of the locally defined memory values can be freed.

The heap is all the memory that is not in the stack and can
essentially be accessed in any scope as long as the layout of data is
known. This memory must be manually managed since it lacks a mechanism
like scoping rules to know when data is no longer needed.


#+begin_src scopes
  local count = 0
  print count
  count = count + 1
  print count
#+end_src

#+RESULTS:
: 0
: 1

Note that the assignment for already instantiated variables is infix.

In scopes there is also another location values can stored in called
the *data segment* which is an actual location in the output
binary. Therefore it is not located on either the stack or the
heap. However, because of this you must be careful not to put too
large of data because your final executable binary will have to carry
it around with it.

Global values can be defined as such.

NOTE: Currently there is a bug in scopes that causes the ~print~
command to show some gobbledy-gook like ~PureCast$halafakes~ instead
of the normal representation of the value. The following snippet shows
how to rectify this with the ~deref~ function which won't be explained
until Level 2.


#+begin_src scopes
  global count = 0
  count = count + 1
  print count
  print (deref count)
#+end_src

#+RESULTS:
: PureCast$fomilutop
: 1


You can unbind names by using ~unlet~:

#+begin_src scopes
  let
      a = 3
      b = 4

  unlet a
  # print a
  print b
#+end_src

#+RESULTS:
: 4


**** Ternary Operator

A ternary operator is one that allows for the input of 3
arguments. Typically this means a kind of choice between two values
depending on the conditional.

#+begin_src scopes
  let a = 3

  let result = (? (a > 2) "bigger than 2" "smaller than 2")

  print result
#+end_src

#+RESULTS:
: bigger than 2

This is more than just a convenience as it provides "branchless"
conditions, which will become more important in high performance code
and especially GPUs, which will be discussed in later levels.

A non-branchless version of the ternary operator can be simulated
using the and/or statements:

#+begin_src scopes
  let a = 3

  let result = ((a > 2) and "bigger than 2" or "smaller than 2")

  print result
#+end_src

#+RESULTS:
: bigger than 2


**** COMMENT Bitwise Operators

TODO move to level 2 for these conversions

Convert an int to a bitstring

Method one of converting a u32 int to a bitstring. This has potential
problems and is more operations.

#+begin_src scopes
  using import String

  let n = 8

  local bits = (String 32)

  for k in (range 32)
      let mask = (1 << k)
      let masked_n = (n & mask)
      let the-bit = (masked_n >> k)
      'append bits (tostring the-bit)

  print bits
#+end_src

#+RESULTS:
: 00010000000000000000000000000000


A better way of doing this, but requires using a u32

#+begin_src scopes

  using import String

  let n = 8:u32

  local bits = (String 32)

  for k in (range 32:u32)
      let bit = ((n >> k) & 1)
      'append bits (tostring bit)

  print bits

#+end_src

#+RESULTS:
: 00010000000000000000000000000000


Function to do this:

#+begin_src scopes
  using import String

  fn reverse-string (str)

      local revstr = (String)
      for char in ('reverse (String str))
          'append revstr char

      (tostring revstr)

  print (reverse-string "hello")

  fn u32_to_bitstring (n)
      local bits = (String 32)

      for k in (range 32:u32)
          let bit = ((n >> k) & 1)
          'append bits (tostring bit)

      return (reverse-string (tostring bits))

  # for i in (range 10:u32)
  #     print (.. (tostring i) ": " (u32_to_bitstring i))

  print (u32_to_bitstring 8:u32)
  print (u32_to_bitstring (~ 8:u32))

#+end_src

#+RESULTS:
: olleh
: 00000000000000000000000000001000
: 11111111111111111111111111110111

*** Special Values

There are a few special values defined in the core language:

- ~none~ :: Which signifies emptiness and uses no storage.
- ~null~ :: Which is similar to a null-pointer and is used for pointer
  comparisons.

Some interesting identities:

#+begin_src scopes
  print (typeof none)
  print (typeof null)

  let a = ()
  print (typeof a)
#+end_src

#+RESULTS:
: Nothing
: NullType
: Nothing

*** Primitive Strings

Strings are anything surrounded by double-quotes ~"~. As we have
already seen:

#+begin_src scopes :tangle _bin/primitives_strings.sc
  print "a string"
  typeof "stringzz"
#+end_src

Multiline strings can be given with quadruple-double-quotes and then
continued using indentation adjusted up to the column after the
quadruple-double-quotes:

#+begin_src scopes :tangle _bin/primitives_strings.sc
  """"a multiline string
      That is continued here
      Thats 4 (four) double-"quotes"
#+end_src

Note you don't need to escape the double-quotes in the block since
multiline blocks are considered "raw", unlike single line strings
where double-quotes need to be escaped:

#+begin_src scopes :tangle _bin/primitives_strings.sc
  print "The man said \"hello\""
#+end_src

Note that unlike languages like Python single quotes (~'~) cannot be used
for delimiting strings like double-quotes (~"~).


#+begin_src scopes :tangle _bin/primitives_strings.sc
  let multiline = """"a multiline string
                      That is continued here
                      Thats 4 (four) double-quotes

  print multiline
#+end_src

For instance this will raise an error:

#+begin_src scopes
  let multiline = """"a multiline string
      That is continued here
      Thats 4 (four) double-quotes
#+end_src

To join strings together you can use the ~..~ operator:

#+begin_src scopes :tangle _bin/primitives_strings.sc

  let header = ("Hello" .. " There:")

  print (header .. " Bob")
#+end_src

Or like the `+=` etc. you can concatenate and assign in a single
statement:

#+begin_src scopes
  local msg = ""

  msg ..= "Dear Scopes,\n"
  msg ..= "    Your charm is irresistable!\n\n"
  msg ..= "    Love,\n"
  msg ..= "    Rust"

  print msg
#+end_src

#+RESULTS:
: Dear Scopes,
:     Your charm is irresistable!
: 
:     Love,
:     Rust

You can get the number of characters in a string with the ~countof~
function:

#+begin_src scopes :tangle _bin/primitives_strings.sc
  let alphabet = "abcdefghijklmnopqrstuvwxyz"

  print (countof alphabet)
#+end_src

You can retrieve a particular character like this:

#+begin_src scopes
  let alphabet = "abcdefghijklmnopqrstuvwxyz"

  alphabet @ 4
  (@ alphabet 4)
#+end_src

#+RESULTS:


There are also some slice routines:

- ~slice~ :: Get characters from start to end
- ~lslice~ :: Get characters to the left of an index
- ~rslice~ :: Get characters to the right of an index

#+begin_src scopes :tangle _bin/primitives_strings.sc
  let alphabet = "abcdefghijklmnopqrstuvwxyz"

  print (slice alphabet 0 3)
  print (lslice alphabet 3)

  print (slice alphabet 3 (countof alphabet))
  print (rslice alphabet 3)
#+end_src

#+RESULTS:
: abc
: abc
: defghijklmnopqrstuvwxyz
: defghijklmnopqrstuvwxyz

One final note is that being a low-level language we will have much
more to talk about with regards to strings in Level 2 for concerns
regarding interop with C and memory allocation etc.

** Converting Values To Strings

You can get the implicit "stringified" version of primitives using
either ~tostring~ or ~repr~.

#+begin_src scopes
  print (tostring 10)
  print (repr 10)
#+end_src

#+RESULTS:
: 10
: 10

~tostring~ give a plain kind of string whereas ~repr~ is meant for
making it look pretty in different contexts. Here it returns the same
result as ~tostring~ but on a terminal it gives the raw string:
~"\x1b[33m10\x1b[0m"~ and when you ~print~ it you get a colored ~10~.

Note that this stringification is not meant to be a reliable
*serialization* of the values and is just meant for human inspection
like for in logs or reporting the value on the terminal.

We will see in higher levels that these two functions are hookable
similar to the Python "magic method" protocols e.g. ~__repr__~.

**** For-Loop

Here is a basic for loop like you would find in python:

#+begin_src scopes :tangle _bin/loop_range-forloop.sc
  local result = 0
  for i in (range 10)
      result + 1
#+end_src

#+RESULTS:


You can loop over the language level lists, but they need to be
"quoted" by placing a single apostrophe ~'~ at the beginning of the
list just like in other Scheme languages. Otherwise it will try to
call the function ~0~ on arguments ~1~ and ~2~.

#+begin_src scopes :tangle _bin/loop_forloop.sc
  for i in '(0 1 2)
      print i
#+end_src

#+RESULTS:
: 0
: 1
: 2

The for-loop also supports the ~break~ and ~continue~ statements which
are similar to those in other languages.

#+begin_src scopes
  for i in (range 10)
      if (i == 1)
          print "continuing"
          continue;
      elseif (i > 2)
          print "breaking"
          break;
      else
          print "nothing"
#+end_src

#+RESULTS:
: nothing
: continuing
: nothing
: breaking

In the for-loop it doesn't make sense for ~break~ and ~continue~ to
return any values which is why they have a semicolon at the end (see
[[Defining & Calling Functions]]) but as we will see below this is
possible.

**** Fold-Loop

The other loop styles are very well suited to a mutation based method
of constructing results. The "fold-loop" provides a more functional
approach to constructing objects and is compatible with iteratively
constructing immutable objects. We will see how this is practical
later when we come across mutable & immutable objects.

Here is a simple example that increments a number:

#+begin_src scopes
  let input = 0

  let result =
      fold (result = input) for i in (range 3)
          result + 1

  print result
#+end_src

First note that the ~input~ to the loop is not a ~local~ definition
and is instead a ~let~, which is not mutable. So we know it is not
being mutated.

The second thing is that we have to actually accept the result of the
loop as if it was a function. This is because the loop really is a
kind of functional construct.

Thirdly, we can break apart the actual loop line. As normal we have
the ~for i in (range 3)~ that is the same as the for-loop. The first
part, ~fold (result = input)~, introduces the inputs to the loop. This
is similar to a function call with a named argument where ~result~ is
the argument name.

In the body of the loop we have the same as the other ones, where the
last line is returned to the next iteration of the loop.

Note that the ~result~ symbol is immutable, equivalent to ~let result
= input~ and cannot be mutated.

Here is another example with an immutable structure, the list.

#+begin_src scopes
  let things = '(0 1 2 3)

  let new-things =
      fold (new-things = '()) for thing in things
          let new-thing = ((thing as i32) + 1)
          cons new-thing new-things

  print new-things
#+end_src

#+RESULTS:
: (4 3 2 1)

There are two small issues with this because of the specifics of
lists, that are inconsequential to the example: 1. the results are in
reverse because of how ~cons~ works and 2. we have to explicitly cast
~thing~ to an int.

We will see more realistic examples later.


*** Defining & Calling Functions

As tradition in Scheme-like functional-ish programming languages there
are a variety of syntaxes for defining functions, due to them being
higher order and possible anonymous. Here we go over the equivalent
ways for defining functions to a simple language like Python.

First we can explicitly define a function with the ~fn~ syntax:

#+begin_src scopes :tangle _bin/functions_definitions.sc
  fn say-hello (name)
      print "Hello:" name

  # and call them like you would guess
  say-hello "Bob"
#+end_src

#+RESULTS:
: Hello: Bob


Functions without any arguments can be called in two ways:

#+begin_src scopes :tangle _bin/functions_definitions.sc
  fn yell ()
      print "AHHHHH!!!!"

  (yell)
  yell;
#+end_src

#+RESULTS:
: AHHHHH!!!!
: AHHHHH!!!!


There is also another function-like construct called ~inline~. Which
behaves very similarly but has properties that will only make sense in
Level 2 when we talk about constant and dynamic values. Here is an
example:

#+begin_src scopes
  inline yell ()
      print "AHHHHH!!!!"

  yell;
#+end_src

#+RESULTS:
: AHHHHH!!!!

As you can see it appears to be the same! We will discuss how it is
different later.


In some situations you might need the builtin ~call~ which is some
syntax for explicitly applying a function to arguments:

#+begin_src scopes
  fn add (x y)
      x + y

  print (call add 1 2)
#+end_src

#+RESULTS:
: 3

*** Return Values

As in all "blocks" in scopes the last value is returned, as was seen
in the loop examples. The same is true for functions:

#+begin_src scopes :tangle _bin/functions_returns.sc
  fn gimme ()
      "that"

  print (gimme)
#+end_src

#+RESULTS:
: that

You can also use a return statement to be explicit:

#+begin_src scopes :tangle _bin/functions_returns.sc
  fn get-over ()
      return "here"

  print (get-over)
#+end_src

#+RESULTS:
: here

Scopes can perform "unpacking" in a general way similar to "tuple
unpacking" in Python using the ~_~ prefix operator. This is often used
to "forward" multiple return values from function returns, rather than
having to do the destructuring yourself.

#+begin_src scopes :tangle _bin/functions_returns.sc
  fn args ()
      _ 1 2 3

  let a b c = (args)
  print a b c
#+end_src

#+RESULTS:
: 1 2 3

You can unpack arguments for function parameters as well:

#+begin_src scopes
  fn trio (a b c)
      print a
      print b
      print c

  let args = '(0 1 2)

  trio (unpack args)

#+end_src

#+RESULTS:
: 0
: 1
: 2


*** Recursion With Functions

Recursion is achieved using ~this-function~:

#+begin_src scopes :tangle _bin/functions_recursion_01.sc
  fn rec-count (n)
      print n
      if (n > 5)
          return;
      this-function (n + 1)

  rec-count 0

#+end_src

#+RESULTS:
: 0
: 1
: 2
: 3
: 4
: 5
: 6

Recursion is a bit more complicated than this however due to type
checking. This will be discussed in much more detail in Level 2, so
don't be surprised if you get errors when trying this on your own.

*** Anonymous Functions AKA Lambdas

Scopes also supports anonymous unnamed functions (typically called
lambdas).

An example with the typical usage of lambdas:

#+begin_src scopes
  print ((fn (x) (x + 1)) 4)
#+end_src

#+RESULTS:
: 5

You can assign the function to a symbol to simulate a normal
declaration:

#+begin_src scopes
  let lambda = (fn (x) (x + 1))

  print (lambda 4)

  let lambda2 =
      fn (x)
          x + 1

  print (lambda2 4)
#+end_src

#+RESULTS:
: 5
: 5


If you want to use the expanded syntax for an anonymous function you
will probably need to make use of the ~call~ builtin.

#+begin_src scopes
  let result =
      call
          fn (x)
              x + 1
          3

  print result
#+end_src

#+RESULTS:
: 4

*** Importing Modules

You can import installed libraries and use their methods such as:

#+begin_src scopes :tangle _bin/modules_import.sc
  import String
  let str = (String.String "hello")
#+end_src

Or you can dump the exported symbols (i.e. functions and variables)
into your current namespace with the ~using~ keyword:

#+begin_src scopes :tangle _bin/modules_using-import.sc
  using import String
  let str = (String "hello")  
#+end_src

You can also directly bind a loaded module to a symbol:

#+begin_src scopes :tangle _bin/modules_using-import.sc
  let string_mod = (import String)
  let str = (string_mod.String "hello")  
#+end_src


You can also do some fancier imports although they are a little
imperfect in their operation.

Firstly you can rebind particular symbols from a module to another
name using the ~from~ keyword:

#+begin_src scopes
  let myString = (from (import String) let String)

  print (myString "Hello")

  print (String "Hello")
#+end_src

#+RESULTS:
: Hello
: hello

However notice that the ~String~ is dumped into the local
namespace. To get around this we can use another (newer) syntax which
accepts keyed values for imported values:

#+begin_src scopes
  from (import String) let
      str = String

  print (typeof str)
  print (str "hello")

  print String
#+end_src

#+RESULTS:
: type
: hello
: $fotuwewed:Scope

This still binds the ~String~ module name to the context. You can
avoid this as well by using this syntax:


**** do-blocks

The ~do~ block can thought of being equivalent to defining and
executing a new unnamed function.

#+begin_src scopes
  let msg = "Do the do"

  do
      print msg
#+end_src

#+RESULTS:
: Do the do

As you can see it can use values in the surrounding scope (a "closure").

But anything defined in the block is not available in the outer scope:

#+begin_src scopes
  let name = "Bob"

  do
      let other = "Alice"
      print "hello" name
      print "hello" other

  # this would raise an error
  # print other

#+end_src

#+RESULTS:
: hello Bob
: hello Alice

The ~do-let-locals~ pattern from above is a nice way to export symbols
from a module in a clean way. It should be used as the most common
convention.

You can also use this block to customize what gets exported. Much like
the ~__all__~ magic variable in Python.

#+begin_src scopes

  fn thing1 ()
      print "Thing1"

  fn thing2 ()
      print "Thing2"


  do
      let mything = thing1
      let thing2
      locals;
#+end_src


But what is ~do~ actually returning as a value?

Consider this code:

#+begin_src scopes
  let scope =
      do
          let
              x = 1
              y = "Hello"
          locals;

  print scope.x
  print scope.y

#+end_src

This is essentially the module which we made above but instead of
exporting it and using it in another module we are just using it right
away.

As the variable name suggests the do block returns a "scope", which we
will talk more about below.

**** Executing a module

Similar to the common python refrain of ~if __name__ == "__main__":~
Scopes has a similar special value that can be used to conditionally
execute code if a module is executed like ~scopes mod.sc~ rather than
being imported using ~main-module?~.

#+begin_src scopes :tangle _bin/modules_main.sc
  print "module code"

  if main-module?
      print "running tests..."
#+end_src

#+RESULTS:
: module code
: running tests...

*** Modules are Just First Class Scopes

We should talk about the namesake of the language ~Scope~, and what
makes it different from a module system like Python.

Python has this saying:

#+begin_quote
Namespaces are one honking great idea -- let's do more of those!
#+end_quote

Which never got taken that seriously because there is no first-class
concept of a "namespace" in Python. However, in Scopes we do have this
first-class namespace and surprisingly its called a ~Scope~.

So now you know where the name comes from.

Above we showed how to create a ~Scope~ using a ~do~ block and how
that is used to export symbols as a module for consumption in other
modules.

#+begin_src scopes
  let scope =
      do
          let
              message = "hello"
              name = "bob"
          locals;

  print (typeof scope)
  for k v in scope (print k ":" v)
#+end_src

#+RESULTS:
: Scope
: message : "hello"
: name : "bob"

This is the simplest and easiest way to construct a ~Scope~. However,
there is a more explicit API that uses the type itself.


One way is to use the ~'bind-symbols~ method:

#+begin_src scopes
  let scope =
      'bind-symbols (Scope)
          message = "hello"
          name = "Bob"

  run-stage;

  print (typeof scope)
  print scope.name
#+end_src

Note you need to do a "run stage" (with ~run-stage~ which will be
talked about much later).


In essence this is all the ~locals~ function above does except in a
convenient way just for everything in the local do-block scope. If you
want complete control over what gets exported and under what name you
are free to do so.

And you should also see that as a consumer of a ~Scope~ from another
module you also have complete control over the ~Scope~ object. We will
see where this comes in handy in cleaning up messy namespaces that are
autogenerated from parsing C header files in Level 2.


Here is an example of this building on a constructed ~Scope~:

#+begin_src scopes
  let scope =
      do
          let
              message = "hello"
              name = "bob"
              junk = "You don't want me"
          locals;

  # remove the "junk" symbol from the scope
  let new-scope =
      fold (scope = (Scope)) for k v in scope

          let name = (k as Symbol as string)

          if (name != "junk")
              'bind scope (Symbol name) v
          else
              scope

  run-stage;

  print new-scope.message

  # this is not in the scope
  # print new-scope.junk
#+end_src

#+RESULTS:
: hello


Scopes are actually a really useful as a mapping data structure for
small numbers of static assets and can kind of replace a Python ~dict~
for a lot of use cases.

To hear more about this and the other utilities of ~Scopes~ see the
section on them in Datastructures.

** Characters

As an addition to the primitive types above there is a useful function
for dealing with single characters.

#+begin_src scopes
  let utf8 = (import UTF-8)

  # convert a single character string literal to a char
  let char = (utf8.char32 "a")

  print (typeof char)
  print char
#+end_src

#+RESULTS:
: i32
: 97

*** Tuples

The tuple is probably the simplest of these. As such we will use it as
an example to describe general features of more complex types and
class-like constructs.

A tuple is an immutable datastructure of a fixed size which can
contain any combination of element types.

You can use the function ~tupleof~ to construct them directly:

#+begin_src scopes
  let tup = (tupleof 1 2:f32 "hello")
  print tup
#+end_src

#+RESULTS:
: (tupleof 1 2.0 "hello")

You can get the values of the tuple in a few ways.

Via unpacking:

#+begin_src scopes
  let tup = (tupleof 1 2:f32 "hello")

  let a b c = (unpack tup)

  print a b c
#+end_src

#+RESULTS:
: 1 2.0 hello

Explicitly accessing values via the ~@~ syntax:

#+begin_src scopes
  let tup = (tupleof 1 2:f32 "hello")

  print (@ tup 2)
  print (tup @ 1)
#+end_src

#+RESULTS:
: hello
: 2.0

There are two methods
#+begin_src scopes
  let tup = (tupleof (a = 1) (b = "hello"))
  print tup

  print ('emit tup 'a)
#+end_src

#+RESULTS:
: (tupleof 1 "hello")
: 1
: hello

#+begin_src scopes
  let tup = (tupleof (a = 1) (b = "hello"))

  print ('explode tup)
#+end_src

#+RESULTS:
: 1 hello


And further you can actually define values to have keys associated
with them, much like the Python ~namedtuple~:

#+begin_src scopes
  let namedtuple = (tupleof (a = 3) (b = "hello"))

  print "a" namedtuple.a
  print "b" namedtuple.b
#+end_src

#+RESULTS:
: a 3
: b hello

Here we see the first use of the "dot" notation which is also used in
Python.

But you can also use the ~@~ selector instead of the keys:

#+begin_src scopes
  let namedtuple = (tupleof (a = 3) (b = "hello"))

  print "0" (namedtuple @ 0)
  print "1" (namedtuple @ 1)
#+end_src

Before we dig into the other datastructures we will go over some of
the common patterns to all of them using the ~tuple~ as an example.

**** Mutability

If you declare a datastructure as ~local~ you can mutate the
components as long as they are the same type as in the construction or
declaration.

For an indexed structure this is:

#+begin_src scopes
  local things = (tupleof 3 "hello")

  things @ 0 = 5
  print (things @ 0)
#+end_src

#+RESULTS:
: 5

Notice that you don't need parens around the first part because of the
infix operator precedence rules, but you can add them if you like:

#+begin_src scopes
  local things = (tupleof 3 "hello")

  (things @ 0) = 5
  print (things @ 0)
#+end_src

#+RESULTS:
: 5


#+TODO: explain this part

#+begin_src scopes
  local things = (tupleof (a = 3) (b = "hello"))

  things.a = 4
  print things.a

  # NOT allowed
  # things.a = "test"
#+end_src

#+RESULTS:
: 4



#+begin_src scopes
  fn scopetest ()
      local t-inside =
          tupleof
              (a = 3)
              (b = "hello")

      print (t-inside @ 0)

      t-inside


  # This won't be mutable since it will rebind it as immutable in the
    outside scope
   
    let t-outside = (scopetest)

  local t-outside = (scopetest)

  print t-outside.a

  t-outside.a = 10

  print t-outside.a

#+end_src

#+RESULTS:
: 3
: 3
: 10


*** Scopes

We saw how ~Scopes~ are the foundation of modules and first class
namespaces in Scopes (the language). This brings up an interesting use
case of a ~Scope~ as a kind of simple "map" type akin to a hash table
or python dictionary.

We saw in the 'List' section how to implement some "map" types with
simple lists, but these are undesirable as data structures because
they are purely syntactic and don't really exist at run time at all.
Lists really only exist to contain syntax and to be manipulated for
macros, the core metaprogramming feature of lisp-like languages.

But what if you aren't metaprogramming? You just want to use something
like Python. In this case a ~Scope~ might be a good choice for
replacing a dictionary.

However, because Scopes is a low-level language there will be a
necessary distinction between data-structures like Hash Maps (see
'Maps' below) which will dynamically allocate memory and static,
immutable ones like the ~Scope~.

~Scopes~ are useful for if you know up front what all the entries will
be in the map, or they rarely change.

For instance you might have the following kind of code somewhere
defining some constants. This could be transformed into a
~Scope~. Both are shown in this snippet:

#+begin_src scopes
  # using variables
  let
      retriever = "A loyal dog that fetches dead ducks."
      poodle = "A haute one, with curly locks."
      dachsund = "Kills badgers."

  print "Variable style"
  print "retriever: " retriever
  print "poodle: " poodle
  print "dachsund: " dachsund


  # using a Scope
  let breeds =
      do
          let
              retriever = "A loyal dog that fetches dead ducks."
              poodle = "A haute one, with curly locks."
              dachsund = "Kills badgers."
          locals;


  print "\nScope style"
  for breed description in breeds
      print description
#+end_src

#+RESULTS:
: Variable style
: retriever:  A loyal dog that fetches dead ducks.
: poodle:  A haute one, with curly locks.
: dachsund:  Kills badgers.
: 
: Scope style
: "A loyal dog that fetches dead ducks."
: "A haute one, with curly locks."
: "Kills badgers."

As you can see in this example you can loop over all of the values in
a ~Scope~.

You can get values out of the scope using a lookup by using the
~getattr~ metamethod:

#+begin_src scopes
  let breeds =
      do
          let
              retriever = "A loyal dog that fetches dead ducks."
              poodle = "A haute one, with curly locks."
              dachsund = "Kills badgers."
          locals;

  # use the symbol syntax
  print (getattr scope 'poodle)

  # programatically construct the symbol
  print (getattr scope (Symbol "dachsund"))
#+end_src

#+RESULTS:
: A haute one, with curly locks.
: Kills badgers.

~Scopes~ also have a number of other operators and metamethods you can
use. Here are some useful ones.


Combine scopes together with ~..~:

#+begin_src scopes
  let breeds =
      do
          let
              retriever = "A loyal dog that fetches dead ducks."
              poodle = "A haute one, with curly locks."
              dachsund = "Kills badgers."
          locals;

  let other-breeds =
      do
          let
              shepherd = "Can keep your sheep in line."
          locals;


  let all-breeds = (.. breeds other-breeds)

  run-stage;

  print all-breeds.shepherd
  print all-breeds.poodle
#+end_src

#+RESULTS:
: Can keep your sheep in line.
: A haute one, with curly locks.


**** COMMENT More Scopes Stuff

Nested ~Scopes~:

#+begin_src scopes
  let breeds =
      do
          let
              retriever = "A loyal dog that fetches dead ducks."
              poodle = "A haute one, with curly locks."
              dachsund = "Kills badgers."
          locals;


  let dog-info =
      do
          let
              breeds = breeds
              dog = "A dog is a kind of quadruped."
          locals;

  print dog-info.dog
  print dog-info.breeds.poodle
#+end_src

#+RESULTS:
: A dog is a kind of quadruped.
: A haute one, with curly locks.
: (nullof Scope):Scope

*** Map

Basics of a Map.

#+begin_src scopes
  using import Map
  using import String

  global mymap : (Map string i32)

  'set mymap "a" 3:i32

  try
      print ('get mymap "a")
  except (e)
      print "'a' not in mymap "
#+end_src

#+RESULTS:
: 3

*** Error Propagation

Error propagation is much the same as you would expect
syntactically. You ~raise~ errors (or call the ~error~ function) and
then you can catch them with a ~try~-~except~ block.

Here is about as simple as it gets:

#+begin_src scopes
  try
      raise "Error"
  except (e)
      print e
#+end_src

#+RESULTS:
: Error

Notice that we aren't raising any specific exception or error types
and instead just a plain string is being raised. Any type of value can
be raised in exceptions.


Just for fun:

#+begin_src scopes
  try
      raise "🤯"
  except (e)
      print e
#+end_src

#+RESULTS:
: 🤯


If you use the ~error~ function it will raise an ~Error~ type object:

#+begin_src scopes
  fn test-error ()
      if true
          error "WRONG!!"
      else
          print "right"

  try
      test-error;
  except (err)
      print "Something bad happened:"
      print err
      print (typeof err)
  ;
#+end_src

#+RESULTS:

Also note that the symbol you bind the exception value to can be
anything.

If you run the function without the try-except block it will raise an
error:

#+begin_src scopes
  fn test-error ()
      if true
          error "WRONG!!"
      else
          print "right"

  test-error;
#+end_src

#+RESULTS:

---

Exceptions in Scopes are monomorphic however which is a fancy way of
saying you can't have different kinds of error values propagated in
the same try block.

So this code is invalid:

#+begin_src scopes
  # INVALID
  try
      if true
          raise "Error"
      else
          raise 1

  except (e)
      print e
#+end_src

#+RESULTS:

And just to bring the point home you will get a similar compiler error
even if you try to use a function with multiple error types:

#+begin_src scopes
  # INVALID
  fn polymorph-errors ()
      if true
          raise "Error"
      else
          raise 1

  polymorph-errors;

  # try
  #     polymorph-errors;
  # except (e)
  #     print e
#+end_src

#+RESULTS:

Technically, the compilation error happens at function instantiation
which occurs when the function is called (this will be discussed in
Level 2), which is why its added in this snippet.

The recommended way of solving this is by using an enum (AKA union)
type as the exception type.

TODO: show how to use an enum for polymorphic errors.

---

Note that because of type checking, some things might not work as
you expect depending on your biases.

For instance consider this invalid code:

#+begin_src scopes
  fn test-error ()
      if true
          error "WRONG!!"

      else
          "right"

  # INVALID
  try
      test-error;
  except (e)
      print "error occured"

  ;
#+end_src

#+RESULTS:

This will result in a compiler error that roughly decsribes that the
returning value from the ~except~ clause conflicts with that of the
~try~ block. This is because the ~test-error~ function returns a
string and the ~except~ block returns nothing (or ~void~).

To fix this code we would need to actually return a string from the
~except~ clause:

#+begin_src scopes
  fn test-error ()
      if true
          error "WRONG!!"

      else
          "right"

  try
      test-error;
  except (e)
      "error occured"

  ;
#+end_src

This might seem strange, but in practice you really should be doing
something like the following to handle error propagation:

#+begin_src scopes
  fn test-error ()
      if true
          error "WRONG!!"

      else
          "right"

  let result =
      try
          test-error;
      except (e)
          "error occured"

  print result
  ;
#+end_src

#+RESULTS:
: error occured

This is similar to the if-else type branching that was explained
previously.

We will see in more detail in higher levels on how to deal with these
typing constraints, but this should be sufficient to avoid the
inevitable confusion on this if you are used to a more dynamic
language.

TODO: add section error types, dispatching, and returning multiple
different kinds of errors.

You can also create your own error types and even do things with
them. This uses concepts that will be discussed in level 2 but the
basics are shown here:

#+begin_src scopes
  using import struct

  struct myException
      msg : string

  try
      raise (myException "an error occurred")
  except (e)
      print e.msg

#+end_src

#+RESULTS:
: an error occurred

*** let assignment

With let it is immutable and so its simple. You can't mutate the value
so there is no chain of references to worry about.

#+begin_src scopes
  let a = 3

  let b = a

  print "a" a
  print "b" b
#+end_src

#+RESULTS:
: a 3
: b 3

Somewhat obviously, if you redefine an immutable variable as something
else, it takes on the new value.

#+begin_src scopes
  let a = 3
  let b = a
  let b = 4

  print "a" a
  print "b" b
#+end_src

#+RESULTS:
: a 3
: b 4

And if you redefine the first value '~a~'it doesn't change the second
value '~b~' because they don't reference each other. ~b~ is a copy of
the value ~a~ initially held:

#+begin_src scopes
  let a = 3
  let b = a
  let a = 4

  print "a" a
  print "b" b
#+end_src

#+RESULTS:
: a 4
: b 3

*** local & global assignment

~local~ and ~global~ are exactly the same! But for different reasons.

The reason is that ~let~ exists purely at the syntactic level, whereas
~local~ and ~global~ exist at run time.

Nonetheless for this level you can think of them as the same.

#+begin_src scopes
  local a = 3

  local b = a

  print "a" a
  print "b" b

#+end_src

#+RESULTS:
: a 3
: b 3

#+begin_src scopes
  local a = 3
  local b = a
  b = 4

  print "a" a
  print "b" b
#+end_src

#+RESULTS:
: a 3
: b 4

#+begin_src scopes
  local a = 3
  local b = a
  a = 4

  print "a" a
  print "b" b
#+end_src

#+RESULTS:
: a 4
: b 3

*** Copying

You can copy values with the ~copy~ macro:

#+begin_src scopes
  using import String

  local a = (String "hello")

  print "a:" a

  local b = (copy a)
  # local c = b

  print "b copied from a:" b
  # print "c aliased from b:" c

  b = (String "goodbye")

  print "b after mutating:" b
  print "a after b is mutated:" a
  # print "c after b is mutated:" c

  ;
#+end_src

#+RESULTS:
: a: hello
: b copied from a: hello
: b after mutating: goodbye
: a after b is mutated: hello


